app/controllers/micro_posts_controller.rb

SELECT "micro_posts".* FROM "micro_posts"
---
  def index
    @micro_posts = MicroPost.all

INSERT INTO "micro_posts" ("Content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["Content", "whatever"], ["created_at", Fri, 27 Dec 2013 05:34:14 UTC +00:00], ["updated_at", Fri, 27 Dec 2013 05:34:14 UTC +00:00], ["user_id", 2]]
---
  def create
    @micro_post = MicroPost.new(micro_post_params)

    respond_to do |format|
      if @micro_post.save

SELECT "micro_posts".* FROM "micro_posts" WHERE "micro_posts"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_micro_post
      @micro_post = MicroPost.find(params[:id])